{"_id":{"$oid":"5ec07379bcff561021784c35"},"Title":"Silence of the Lambs","Description":"A young FBI cadet must receive the help of an incarcerated and manipulative cannibal killer.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience."},"Director":{"Name":"Jonathan Demme","Bio":"Robert Jonathan Demme was an American director, producer, and screenwriter.","Birth":"1944","Death":"2017"},"ImagePath":"silenceofthelambs.png","Featured":true}
{"_id":{"$oid":"5ec07388bcff561021784c36"},"Title":"The Shawshank Redemption","Description":"Two imprisoned men bond over a number of years, finding solace and eventual redemption through acts of common decency.","Genre":{"Name":"Drama","Description":"Within film, television and radio (but not theatre), drama is a genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone, focusing on in-depth development of realistic characters who must deal with realistic emotional struggles."},"Director":{"Name":"Frank Darabont","Bio":"Three-time Oscar nominee Frank Darabont was born in a refugee camp in 1959 in Montbeliard, France, the son of Hungarian parents who had fled Budapest during the failed 1956 Hungarian revolution. Brought to America as an infant, he settled with his family in Los Angeles and attended Hollywood High School.","Birth":"1959"},"ImagePath":"shawshank.png","Featured":false}
{"_id":{"$oid":"5ec07416bcff561021784c37"},"Title":"Dr. Strangelove","Description":"An insane general triggers a path to nuclear holocaust that a War Room full of politicians and generals frantically tries to stop.","Genre":{"Name":"Thriller","Description":"Thriller film, also known as suspense film or suspense thriller, is a broad film genre that involves excitement and suspense in the audience. Tension is created by delaying what the audience sees as inevitable, and is built through situations that are menacing or where escape seems impossible."},"Director":{"Name":"Stanley Kubrick","Bio":"Stanley Kubrick was born in Manhattan, New York City, to Sadie Gertrude (Perveler) and Jacob Leonard Kubrick, a physician. His family were Jewish immigrants (from Austria, Romania, and Russia). Stanley was considered intelligent, despite poor grades at school. Hoping that a change of scenery would produce better academic performance, Kubrick's father sent him in 1940 to Pasadena, California, to stay with his uncle, Martin Perveler. Returning to the Bronx in 1941 for his last year of grammar school, there seemed to be little change in his attitude or his results. Hoping to find something to interest his son, Jack introduced Stanley to chess, with the desired result. Kubrick took to the game passionately, and quickly became a skilled player. Chess would become an important device for Kubrick in later years, often as a tool for dealing with recalcitrant actors, but also as an artistic motif in his films.","Birth":"1928","Death":"1999"},"ImagePath":"drstrangelove.png","Featured":true}
{"_id":{"$oid":"5ec074ddbcff561021784c38"},"Title":"The Departed","Description":"An undercover cop and a mole in the police attempt to identify each other while infiltrating an Irish gang in South Boston.","Genre":{"Name":"Crime","Description":"A crime story is about a crime that is being committed or was committed. It can also be an account of a criminal''s life. It often falls into the action or adventure genres."},"Director":{"Name":"Martin Scorsese","Bio":"Martin Charles Scorsese was born on November 17, 1942 in Queens, New York City, to Catherine Scorsese (née Cappa) and Charles Scorsese, who both worked in Manhattan's garment district, and whose families both came from Palermo, Sicily. He was raised in the neighborhood of Little Italy, which later provided the inspiration for several of his films. Scorsese earned a B.S. degree in film communications in 1964, followed by an M.A. in the same field in 1966 at New York University's School of Film. During this time, he made numerous prize-winning short films including The Big Shave (1967), and directed his first feature film, Who's That Knocking at My Door (1967).","Birth":"1942"},"ImagePath":"thedeparted.png","Featured":false}
{"_id":{"$oid":"5ec07543bcff561021784c39"},"Title":"The Usual Suspects","Description":"A sole survivor tells of the twisty events leading up to a horrific gun battle on a boat, which began when five criminals met at a seemingly random police lineup.","Genre":{"Name":"Crime","Description":"A crime story is about a crime that is being committed or was committed. It can also be an account of a criminal''s life. It often falls into the action or adventure genres."},"Director":{"Name":"Bryan Singer","Bio":"Bryan Singer was born on September 17, 1965 in New York City, New York, USA as Bryan Jay Singer. He is a producer and director, known for X-Men (2000), The Usual Suspects (1995) and X-Men: Days of Future Past (2014).","Birth":"1965"},"ImagePath":"theusualsuspects.png","Featured":false}
{"_id":{"$oid":"5ec07556bcff561021784c3a"},"Title":"12 Angry Men","Description":"A jury holdout attempts to prevent a miscarriage of justice by forcing his colleagues to reconsider the evidence.","Genre":{"Name":"Drama","Description":"Within film, television and radio (but not theatre), drama is a genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone, focusing on in-depth development of realistic characters who must deal with realistic emotional struggles."},"Director":{"Name":"Sidney Lumet","Bio":"Sidney Lumet was a master of cinema, best known for his technical knowledge and his skill at getting first-rate performances from his actors -- and for shooting most of his films in his beloved New York. He made over 40 movies, often complex and emotional, but seldom overly sentimental. Although his politics were somewhat left-leaning and he often treated socially relevant themes in his films, Lumet didn't want to make political movies in the first place.","Birth":"1924","Death":"2011"},"ImagePath":"12angrymen.png","Featured":true}
{"_id":{"$oid":"5ec07556bcff561021784c3b"},"Title":"The Lord of the Rings: The Fellowship of the Ring","Description":"A meek Hobbit from the Shire and eight companions set out on a journey to destroy the powerful One Ring and save Middle-earth from the Dark Lord Sauron.","Genre":{"Name":"Fantasy","Description":"Fantasy is a genre of speculative fiction set in a fictional universe, often inspired by real world myth and folklore. Its roots are in oral traditions, which then became fantasy literature and drama. From the twentieth century it has expanded further into various media, including film, television, graphic novels, manga and video games."},"Director":{"Name":"Peter Jackson","Bio":"Peter Jackson was born as an only child in a small coast-side town in New Zealand in 1961. When a friend of his parents bought him a super 8 movie camera (because she saw how much he enjoyed taking photos), the then eight-year-old Peter instantly grabbed the thing to start recording his own movies, which he made with his friends.","Birth":"1961"},"ImagePath":"lotrfellowship.png","Featured":false}
{"_id":{"$oid":"5ec07556bcff561021784c3c"},"Title":"Goodfellas","Description":"The story of Henry Hill and his life in the mob, covering his relationship with his wife Karen Hill and his mob partners Jimmy Conway and Tommy DeVito in the Italian-American crime syndicate.","Genre":{"Name":"Crime","Description":"A crime story is about a crime that is being committed or was committed. It can also be an account of a criminal''s life. It often falls into the action or adventure genres."},"Director":{"Name":"Martin Scorsese","Bio":"Martin Charles Scorsese was born on November 17, 1942 in Queens, New York City, to Catherine Scorsese (née Cappa) and Charles Scorsese, who both worked in Manhattan's garment district, and whose families both came from Palermo, Sicily. He was raised in the neighborhood of Little Italy, which later provided the inspiration for several of his films. Scorsese earned a B.S. degree in film communications in 1964, followed by an M.A. in the same field in 1966 at New York University's School of Film. During this time, he made numerous prize-winning short films including The Big Shave (1967), and directed his first feature film, Who's That Knocking at My Door (1967).","Birth":"1942"},"ImagePath":"goodfellas.png","Featured":false}
{"_id":{"$oid":"5ec07556bcff561021784c3d"},"Title":"Spirited Away","Description":"During her family's move to the suburbs, a sullen 10-year-old girl wanders into a world ruled by gods, witches, and spirits, and where humans are changed into beasts.","Genre":{"Name":"Animated","Description":"Animation is a method in which pictures are manipulated to appear as moving images. In traditional animation, images are drawn or painted by hand on transparent celluloid sheets to be photographed and exhibited on film."},"Director":{"Name":"Hayao Miyazaki","Bio":"Hayao Miyazaki was born in Tokyo on January 5, 1941. He started his career in 1963 as an animator at the Toei Douga studio, and was subsequently involved in many early classics of Japanese animation. From the beginning, he commanded attention with his incredible drawing ability and the seemingly endless stream of movie ideas he proposed.","Birth":"1941"},"ImagePath":"spiritedaway.png","Featured":false}
{"_id":{"$oid":"5ec07556bcff561021784c3e"},"Title":"Apocalypse Now","Description":"A U.S. Army officer serving in Vietnam is tasked with assassinating a renegade Special Forces Colonel who sees himself as a god.","Genre":{"Name":"Drama","Description":"Within film, television and radio (but not theatre), drama is a genre of narrative fiction (or semi-fiction) intended to be more serious than humorous in tone, focusing on in-depth development of realistic characters who must deal with realistic emotional struggles."},"Director":{"Name":"Francis Ford Coppola","Bio":"Francis Ford Coppola was born in 1939 in Detroit, Michigan, but grew up in a New York suburb in a creative, supportive Italian-American family. His father, Carmine Coppola, was a composer and musician. His mother, Italia Coppola (née Pennino), had been an actress. Francis Ford Coppola graduated with a degree in drama from Hofstra University, and did graduate work at UCLA in filmmaking.","Birth":"1939"},"ImagePath":"apocalypsenow.png","Featured":true}
{"_id":{"$oid":"5ec07556bcff561021784c3f"},"Title":"Reservoir Dogs","Description":"When a simple jewelry heist goes horribly wrong, the surviving criminals begin to suspect that one of them is a police informant.","Genre":{"Name":"Crime","Description":"A crime story is about a crime that is being committed or was committed. It can also be an account of a criminal''s life. It often falls into the action or adventure genres."},"Director":{"Name":"Quentin Tarantino","Bio":"Quentin Jerome Tarantino was born in Knoxville, Tennessee. His father, Tony Tarantino, is an Italian-American actor and musician from New York, and his mother, Connie (McHugh), is a nurse from Tennessee. Quentin moved with his mother to Torrance, California, when he was four years old.","Birth":"1963"},"ImagePath":"reservoirdogs.png","Featured":false}
